# Criando os nomes

In [1]:
import pandas as pd

In [7]:
nomes_f = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f")
nomes_m = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m")

In [10]:
print(f'Quantidade de nomes: {len(nomes_f) + len(nomes_m)}')

Quantidade de nomes: 400

In [11]:
frames = [nomes_f, nomes_m]

In [43]:
type(frames)

list

In [19]:
nomes = pd.concat(frames)['nome'].to_frame()

In [21]:
nomes.sample(5)

          nome
117     WAGNER
2    FRANCISCA
75      NELSON
50    VINICIUS
101     SILVIO

In [26]:
nomes.columns.name = ''

In [27]:
nomes.head()

        nome
0      MARIA
1        ANA
2  FRANCISCA
3    ANTONIA
4    ADRIANA

# Incluindo ID dos Alunos

In [30]:
import numpy as np
np.random.seed(123)

In [31]:
total_alunos = len(nomes)
total_alunos

400

In [32]:
nomes['id_aluno'] = np.random.permutation(total_alunos) + 1

In [36]:
nomes.sample(5)

        nome  id_aluno
92     DIOGO        61
166    KELLY       109
98     THAIS       148
142     HUGO       378
184  MARILIA       282

In [37]:
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [38]:
nomes

          nome  id_aluno                 dominio
0        MARIA       235     @servicodoemail.com
1          ANA        43  @dominiodoemail.com.br
2    FRANCISCA       304     @servicodoemail.com
3      ANTONIA       156     @servicodoemail.com
4      ADRIANA       343  @dominiodoemail.com.br
..         ...       ...                     ...
195     WALTER       231     @servicodoemail.com
196    ARLINDO        99     @servicodoemail.com
197    MICHAEL       323     @servicodoemail.com
198     ALVARO       383  @dominiodoemail.com.br
199    GEOVANE       366  @dominiodoemail.com.br

[400 rows x 3 columns]

In [39]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [41]:
nomes.sample(5)

         nome  id_aluno                 dominio                         email
75     NELSON       392  @dominiodoemail.com.br  nelson@dominiodoemail.com.br
18   RAIMUNDO        70     @servicodoemail.com   raimundo@servicodoemail.com
120   JOSIANE       178     @servicodoemail.com    josiane@servicodoemail.com
74       ALAN       355  @dominiodoemail.com.br    alan@dominiodoemail.com.br
71      MARTA       265  @dominiodoemail.com.br   marta@dominiodoemail.com.br

In [42]:
?cat()